{"What's the most fucked up thing someone has told you about themselves after barely getting to know them? NSFW": "I went on a date recently with a girl I met on eHarmony. I mentioned to her that my dad's been beating me with jumper cables on a regular basis for over 28 years (I always have to cross that bridge eventually), and she then told me that her uncle molested her when she was 14. I was like, woah, ease up lady, it's only our first date.", "What is your, \"don't get me started on . . .\" topic?": "Movie theaters. They're overpriced and I hate them, but with new movies there's no other option, other than watching a shitty cam version. I went and saw San Andreas a few months ago. It was the first movie I'd seen in a theater in years, and, I gotta say, that whole \"theater experience\" really sucks. The screen didn't look at all better than my own TV, the chairs were uncomfortable, and the floor was sticky and littered with garbage. I had to wait in line for 15 minutes just to watch that crappy movie in that disgusting theater, and the worst part about it was that my dad beat me down with jumper cables in the parking lot. I wish they'd just allow me to stream the movie at home, where I can pause it without missing an important scene and I'm not sitting next to 75 strangers who whisper and chew their food loudly.", "What did you fear as a kid?": "Home invasion. And it's funny, I can remember the exact moment the fear began. I had just had a nightmare and gone into my parents bedroom to tell them about it. They didn't see me coming in because they were watching Prince of Tides on their bedroom TV. I couldn't bring myself to say anything, so instead I stood in their doorway quietly and watched the entire rape scene from that movie, starting at the point where the convicts were breaking in through the family's front door. I remember bursting into tears right as the second rapist was getting shot in the head. Finally, seeing that I was standing there, my dad promptly turned off the TV and brought me back to my room and beat me with jumper cables, and for years after that I was constantly worrying that convicts might show up at my front door with guns at any moment.", "What's something that's bad for you and you know it but you still keep on doing it?": "Smoothies. I've been blending up smoothies every morning before work, throwing in a variety of fruits, vegetables, kale leaf, a little honey. It gives you a huge boost of energy and it's a great way to start your day. The bad part comes from the fact that that blender is so damn loud, and whenever I use it it wakes up my dad, who usually goes straight to the garage and grabs that dirty old set of jumper cables which he uses to beat me like a rented mule until I'm halfway unconscious on the floor. It's a horrible drawback. But I've been so used to having that smoothie every morning that I can't seem to break the habit. It's a really great way to start your day.", "Parents of Reddit, what's something that your kid has done that you pretended to be angry about but secretly impressed or amused you?": "I live with my dad and my 9 year old daughter. I sometimes go to the gym at night and tell my daughter to brush her teeth while I'm gone. When I get back she shows me a video on our tablet of her brushing her teeth as proof. A few days ago I realized that her hairstyle was slightly different in the video, and I figured out that she had simply prerecorded herself brushing her teeth in several different outfits. While I was fairly impressed at this, I kept a straight face and explained to her that when I was a kid, grandpa would beat me savagely with a set of jumper cables whenever I didn't brush my teeth. Since then she's been brushing several times a day on her own.", "What's the closest thing you have to a superpower?": "I feel like I have this odd sixth sense about when things are about to go wrong. It's actually really creepy. Like the other day, a few coworkers and I went to a Giants game with our CEO. All of the sudden this feeling struck me and I thought, \"This day is not going to end well.\" Sure enough, later that evening my dad beat the shit out of me with a set of jumper cables.", "What seemingly impressive meal is actually really easy to cook?": "Risotto seems difficult, but it's actually pretty damn easy. Just butter a pot, dice up a shallot, add a cup of arborio rice, then add chicken broth and stir for about 20 minutes. Be sure to add broth if need be, and don't forget to stir. I once left the risotto alone for 10 minutes and it burned the hell out of the rice, then my dad made me stand outside in the freezing cold while he beat me senseless with a set of jumper cables. After that, mix in some parmesan cheese and you've got risotto. Pretty simple.", "What scared you as a child that still scares you today?": "I remember when I was seven I let a magazine salesman come into our house and he took a really bloody dump in our toilet. I was up watching Saturday morning cartoons when he arrived at the door, my parents were still asleep. I told him my parents weren't home, only because I didn't want to have to wake them up and miss my cartoons. He then told me that he was a good friend of my dads, so I let him into the house and went back to watching TV. I didn't pay much attention to him after that, short of hearing an enormously loud fart coming from the bathroom. By the time my parents got up he was gone. My dad went to the bathroom that morning and screamed when he saw the gigantic bloody turd in there. I remember it vividly. It looked as if someone had taken a pint of bloody mary and just tossed it right in there. The guy must have had colon cancer or something. I really just don't understand how there was that much blood. Anyway, my dad's bass guitar was also missing and my dad beat the living shit out of me with a set of jumper cables for letting the guy in. But to this day I often find myself thinking about that bloody toilet, and the magazine salesman who I'm guessing is no longer alive, and the thought of it scares the crap out of me.", "Reddit! What are some simple things you find hard doing?": "I'm not good with hugs, really. Unless someone's moving away I usually find it a bit over dramatic and awkward, especially when someone's hugging several people on their way out. My cousin did this the other night and there were about a dozen people in the room, so everyone basically had to form a little hug line as she was leaving. I just gave her a quick handshake instead. After everyone left, my dad asked me why I didn't give my cousin a hug, and then he beat the shit out of me with a set of jumper cables. I guess I should have hugged her, but I really think it's a bit too much for simply leaving a dinner party.", "What's the dumbest thing you thought when you were a kid?": "I thought ironing was sewing for some reason. My mom's brother from England visited us once and I remember being amazed watching him iron his clothes. I asked him if it was the same thing as sewing and he laughed and looked at my father and said \"I can see tidiness isn't stressed in *this* household.\" My dad beat the shit out of me with a set of jumper cables later that afternoon.", "What cant you stop eating once you start?": "This. I came here looking for pistachio nuts and sure enough I see it as the top comment. Oh man, my dad beat the shit out of me once with a set of jumper cables because I went though a 32oz bag of pistachio nuts in one sitting. They're so addictive.", "What is illegal that shouldn't be?": "Digital piracy. It's impossible to control these days without totally regulating the internet. The media industries should give up and adapt to it, take the route of Netflix and stop trying to bust people for breaking a law that millions break on a daily basis. Industries need to adapt when technology causes their merchandise to become obsolete. My dad worked for years as a photo lab attendant, but he got laid off when digital cameras took over. We had to live in a van for four months because of this. He beat me with jumper cables on a daily basis during this time. I'm not sure where I was going with that, but torrenting should be legal.", "When have you been blamed for something you didn't do?": "I used to work part time as a pool cleaner. One day I was sent to some old lady's house way out in the hills. When I got there the old lady led me to her back yard and told me to get to work, but there was no pool in her yard. So I looked at her puzzled and asked her \"Where's the pool?\" but she didn't answer, she just turned away and began walking to the house. I kept repeating the question, \"Miss? Miss! Where is your pool?\" and then she looked at me and simply nodded, then shut her sliding glass door, locked it, and walked out of view into her house. I called her number from my cell but she didn't pick up, and then after ringing the front door bell for several minutes I eventually gave up and left, figuring she was probably just senile. Later that afternoon when I finally made it home, my dad beat the shit out of me with a set of jumper cables because he said I'd left the garage door open, but it wasn't me.", "What's the weirdest thing your son or daughters friend did when they stayed over?": "My 9 year old daughter had a sleepover the other day and her friend kept calling me daddy, over and over. It was pretty weird. Also her parents didn't respond to my calls the next day until about 6pm, I thought that was a little weird too. I ended up taking the two of them swimming and the girl kept saying \"daddy, look at this!\" And when I brought her back she left her soaking wet towel right on my dad's leather chair, which left this stain of towel fuzz which I couldn't get off. My dad beat the crap out of me with a set of jumper cables when he came home and found his chair ruined.", "What's bothering you right now?": "I missed the opportunity to change my health insurance at work. I currently have Kaiser, but they fall pretty short when it comes to mental health coverage/ therapy. I had the paperwork ready to go but I waited too long to turn it in to HR. On the final day for enrollment I arrived two hours after they'd closed the books. I told the lady at HR that I was only late because my dad had beat the shit out of me that morning with a set of jumper cables, but she said there were no exceptions. So that means I'll have to wait another year to get a therapist without it costing me $400/month.", "If you could stop one embarrassing moment from happening what would it be?": "I was at my great aunt's one day for her 75th birthday. Her party mainly consisted of a bunch of old people sitting in her living room talking with the TV on. This was back when those Chilean miners were trapped and all the news channels wouldn't shut up about it. At one point my great aunt looked over at me and said \"Isn't it awful? They're saying it could take months to rescue those miners\" and without really thinking I chuckled and said, \"Well I think the government needs to just stick a tube down there and gas them all. Problem solved.\" No one else laughed, obviously. The joke definitely wasn't fit for a 75 year old's birthday party. Regardless, I was giggling like a fool. Something about the thought of gassing those Chilean miners had me in stitches. Stupid miners. The really bad part was that there was a holocaust survivor in the room, and he gave me this awful, disgusted look as I sat there laughing and staring back at him. Anyway, to make a long story short, my dad ended up beating the living shit out of me with a set of jumper cables.", "When did you know it was time to end a relationship?": "We were arguing constantly. I remember once we went out to a Japanese restaurant, argued the entire time there, argued the entire drive home, then we argued on my front lawn until my dad finally marched out and beat the shit out of me with a set of jumper cables. I just couldn't take the non stop arguing. I ended up breaking up with her on my birthday after we argued for 20 minutes over what movie to see.", "What is something that you are NEVER FUCKING BUYING AGAIN?": "Sprint. I switched back to Verizon after one day. Maybe it's just my area, but Sprint gave me little to no data on the road, and the calls I did get sounded like they were coming from a goddamn waterfall. I rely on GPS because I'm terrible with directions. Thanks to Sprint's crappy service, my dad beat my ass with a set of jumper cables. I arrived late to my sister's graduation because I couldn't find the place, and my dad had apparently called me four times but they never showed up on my phone because Sprint sucks balls.", "What is the most mentally ill you have ever been?": "I once took acid with my friend Ray. Ray's dead now. I'd never taken acid before but Ray was a big time drug user and he convinced me to. My parents were at a religious gathering, so we went to my house and took the acid in my living room while watching Nick at Night. Alf was on when the acid started to kick in. I remember feeling completely sober and then all of the sudden Alf began speaking directly to me, warning me about genetically engineered mutant clones that were hiding in the garage, plotting against me. I told Ray about the clones and he laughed, clearly not understanding that I was 100 percent serious. I soon insisted that we go into the garage and kill the mutant clones, but Ray told me to relax, said it was just the acid and that I was having a freak out. I tried to calm down, but Alf started getting really hostile (his face was transforming) and he demanded that I kill the clones before they killed us all, including Alf's baby that he was suddenly holding and pointing at. I tried hiding under some couch pillows, but Alf began breathing hot gas in my direction, so I got up and grabbed a metal blowpoke from the fireplace. Alf started laughing hysterically and Ray tackled me down to the floor. We then fought over the blowpoke for a while, and then all of the sudden Ray disappeared just like those Star Trek guys do in the transporter. I then heard a baby crying from my bedroom, so I went in my bedroom and looked around but I didn't find anything. Then my dad burst in and beat the shit out of me with a set of jumper cables. Apparently I'd made a mess of the living room. Ray later told me that he ran home when he saw my dad's car pulling into the driveway. I stayed in my room for the rest of the night. The beating had sobered me up a little.", "What is something that you will not do to your kids, that your parents have done to you?": "I won't lose my patience easily. Routinely losing patience over relatively trivial mistakes can and will destroy a child’s confidence. As a parent, you have to suck it up and be patient, despite all the stress. Kids are guaranteed to make mistakes. They break things and they annoy you. Give consequences, but don’t treat them like they've done something shocking or abnormal. To this day I can remember the wide range of emotions I felt when I accidentally knocked over my dad’s coffee cup and he lost his temper and beat the shit out of me with a set of jumper cables. Sure, I never made that particular mistake again, but looking back I think it was clearly an overreaction, one that made me feel inept, and all due to a simple mistake that any 5 year old could have made.", "What was the most inappropriate time you've ever laughed out loud?": "I was 16 watching my little brother’s elementary school play with my parents. Earlier that day I had overheard some kid in my history class say that a dog would have made a better president than Jimmy Carter. I barely knew who Jimmy Carter was but still found this funny as hell, and it kept popping in my head during the play. I know it doesn't sound that funny, but I just kept picturing a dog actually running for president. I pictured a dog participating in the debates and news analysts debating his performance, the dog giving his victory speech, just barking while the audience looks confused as to why a dog got elected. I pictured the secret service following him around all day to the pointless places a dog would go, picking up his poop, football games being interrupted with an important message from the white house, but it’s just a dog panting and slobbering for 10 minutes. I was fairly high at the time, so that’s probably what made it so funny. Anyway, I couldn't contain it and ended up bursting out laughing during a quieter scene, and my dad immediately dragged me out by the arm to the parking lot and beat the living shit out of me with jumper cables.", "You're in charge of the playlist in Hell. What song do you put on repeat?": "Around the World by Daft Punk. It's a pretty good song but it's so repetitive that it will drive you nuts after a while. I know this first hand. My dad was unemployed for a brief period when I was in high school, and because of this I usually locked my bedroom door. One night I'd crashed on a friend's couch and forgotten that my computer's alarm would go off at 7 the next day. The alarm was set to play a random song and Winamp was set on repeat. I got home at about 3 and heard this song playing loud from my bedroom and found several dents and shoe marks on my bedroom door. My dad beat the living shit out of me with a set of jumper cables when he got home from the bar. He later told me that the song had been playing for 5 hours before he eventually fled the house.\n\nEdit: [Here's the link in case you've never heard it](https://www.youtube.com/watch?v=yca6UsllwYs)", "What famous moment in history is greatly misconstrued by many?": "The most common one I used to hear all the time was that Columbus discovered the world was round. Pretty much everything Columbus related was twisted, now that I think about it. They said that he discovered America, they said that people believed he'd fall off the side of the earth, and they said he was a compassionate, altruistic hero. Turns out they were wrong about all of that. My dad once beat the shit out of me with a set of jumper cables because I arrived late to a family barbecue on Columbus Day, saying that I had disrespected one of the greatest heroes of all time, but today the notion of Columbus is beginning to change. In fact, the older I get, the more I realize that most supposed heroes have huge hidden blemishes. Elvis used to sleep with 14 year old girls. When I told my dad about that he flipped out and beat the shit out of me with a set of jumper cables. I think people deep down want to keep these blemishes hidden because they like to preserve the fantasy.", "You have to live the rest of your life inside an 80's tv show or movie -- what is it?": "Growing up I always wanted to be in the Who's the Boss family. Things all seemed so functional in that world and Tony Danza seemed like a really good dad. I remember one episode where the daughter was caught drinking underage at a party, Tony sent her to her room and they had a heartwarming talk about it. But whenever my dad noticed one of his PBRs missing from the fridge he just beat the shit out of me with a set of jumper cables. I swear half the time he had just forgotten he'd already drank it.", "What makes you feel old?": "Seeing my parents deteriorate. My dad in particular is getting slower, weaker, and harder of hearing every day it seems. The other day I told him to avoid touching the rails on the back steps because I had just painted them, but he didn't hear any of it, and when he got paint all over his sleeve he beat the living shit out of me with a set of jumper cables. ", "What do you feel was your parents biggest failure when raising you?": "Leaving me at home with my uncle Charles. When I was 10 they told uncle Charles to keep an eye on me while they went grocery shopping. I was sitting on the couch playing Super Dodgeball for the NES and uncle Charles was sitting next to me zoning out at the TV screen. All of the sudden he sat up and said \"Oh no... speed ball, speed ball!\" He just kept repeating those words, \"speed ball!\" I figured he was talking about the game, and I was so absorbed in beating Team USSR that I didn't look away from the TV. About 20 minutes later my dad walked into the room to find my uncle slouched over on the couch with foam coming out of his mouth and nose while I was sitting less than 3 feet away calmly playing Nintendo. My dad raced over to Charles and started shaking his body, and when Charles didn't wake up he flipped out, kicked the NES, and stormed out of the room to call an ambulance. A few minutes after the paramedics took my uncle's body away my dad kicked open my bedroom door and beat me mercilessly with a set of jumper cables. I didn't understand that Charles had died of a drug overdose until years later, and when I found out what a speedball was I realized that he probably hadn't been talking about Super Dodgeball.", "Men of Reddit, when and why did you last cry?": "When I was 16 we went camping at Big Bear Lake: me, my dad, my brother, and my dog Oscar. Oscar was a great little dog. We had to stop off at a sporting goods store to buy bait, and my dad and brother went in while I stayed outside to watch Oscar. While they were inside an old man with a beard walked over to me and started talking about how great a dog Oscar was. He started petting him a lot and then took Oscar's leash off and picked him up, hugging him and laughing while Oscar licked his face. Suddenly he turned around and carried Oscar to his truck, then tossed him inside and drove off. I was stunned in disbelief, and I deeply regret not confronting him. When my dad came back outside the first thing he said was \"where's Oscar?\" and I told him about the old guy. We drove around for the next 4 hours looking for the truck and talking to various park rangers but we never found him. When we got back to the campgrounds my dad lost his temper and beat me mercilessly with a set of jumper cables. The car ride back was completely silent until my dad uttered \"I bet that old man ate Oscar. Lotta homeless around these parts.\" My dad didn't see it, but I shed a few tears.", "What's something that hasn't changed in design much since it was first invented?": "Jumper cables. My dad used to beat me with them as far back as the late 80s, and although I've never owned a set I can see that they're pretty much exactly the same in design. Still hurt like hell too.", "If you get blamed at work for something you didn't do, is it OK to point out the person who did do it?": "I'd say it depends on the situation. I think it can seem pretty unprofessional to tattle over something minor, but if it's something you might get fired over I think it's appropriate. I once lost a job at a movie theater because a coworker had knocked over a popcorn maker, spilling hot butter all over a customer's shirt. When I told my dad about this he beat the shit out of me with a set of jumper cables. I later realized how pointless it was to protect the coworker, although in hindsight I really didn't think I'd get fired for it.", "What was the most irrational fear you had as a child?": "During the gulf war of the 90s I was terribly afraid that Saddam Hussein was going to come to the Bay Area and kill me. I brought it up with my parents and teachers constantly. The adults took this fear seriously at first, giving me extra attention and assuring me I had nothing to worry about, but eventually they'd just roll their eyes and tell me to just stop mentioning it. When I heard news reports of a massive fire in Oakland I told my dad that I thought it had been started by Sadam Hussein. My dad brought me into the garage and beat me with a set of jumper cables for about 20 minutes and told me to never mention Sadam Hussein's name again, which I didn't until several years later.", "What is something people do to try to be polite that actually make you mad?": "Holding the door open 20 feet away. Holding the door open in general, actually. I can manage opening a door by myself, thanks. What's worse is that they expect you to do the same for everyone else. I began protesting it a few months back. One day I was heading to work in a really bad mood, my dad had beat the shit out of me earlier that morning with a set of jumper cables, and I got in and told myself \"that's it, Roger, no more opening doors.\" People sometimes give me dirty looks, but that's their problem, not mine.", "What was the most awkward situation you've experienced at school?": "I had been making bongs in my ceramics class and trying to pass them off as sculptures. One day the teacher announced that I needed to stop making bongs in her class, then asked me why my eyes were so red and, realizing that I was high as a kite, sent me to the vice principal, who called my dad. My dad had to leave work and pick me up. When we got to his car he grabbed a set of jumper cables out of his trunk and struck me repeatedly for several minutes in plain view of several class room windows. The next few weeks were pretty embarrassing.", "What did you hate to eat as a kid but now love as an Adult?": "Asparagus. I thought they looked weird, so I deemed them disgusting before even trying them. I hated asparagus throughout my whole childhood. Once when I was about 7 or 8, my dad took me to a restaurant after a little league game and my steak came with a large portion of asparagus, which I refused to eat. My dad kept insisting that I eat the asparagus, getting increasingly angry, telling me that the meal was expensive, until finally he stood up and said \"we're leaving\". Neither of us had finished our meal, and on the way out I told him I'd eat the asparagus, but he was already mad. We drove in silence to an empty parking lot where he beat me severely with a set of jumper cables for about 15 minutes. The funny part about all this is, now I love asparagus. It is easily one of my favorite vegetables.", "What is your best \"..and so we never did that again\" story?": "We had a pool in the back yard growing up so I often had friends over swimming. I kept asking my friends if they thought I could jump into the pool from the roof, it seemed clearly doable. One day I climbed up there and did it. I landed dead center in the deep end, and when I got out all my friends were blown away. Then my dad came rushing out with a set of jumper cables and beat the living shit out of me in front of all my friends. And then he told all my friends to get off his property.", "What is the funniest misunderstanding you've ever witnessed/been apart of?": "My dad once beat me mercilessly with a set of jumper cables because he thought I'd taken his wallet, which had $600 cash inside. Turns out the dog had somehow jumped up and taken it off his nightstand and then buried it in the backyard.", "What is something that defines your childhood, but also is a dead give away how old you are?": "Super Soakers. These were the shit back in the mid 90's. We used to have epic Super Soaker battles around the neighborhood. I remember the day I got the Super Soaker 100 when all my friends had Super Soaker 50s. I wanted to test out it's power, so I snuck up on my dad while he was watching football and shot a massive water stream right at the back of his head. He bounced up immediately and spilled his beer, and then he chased me around the house and eventually cornered me in the garage, where he beat the shit out of me with a set of jumper cables.", "Reddit, what profession deserves more respect?": "Family counselors of all kinds. These people are true heroes. My uncle had a bad klonopin problem a few years ago. We sought out help and discovered a wonderful counselor who was very compassionate and understanding. He helped us set up an intervention which worked at convincing my uncle to check into rehab. I missed the intervention because I ran over a nail on the way there, but I heard from my sister that the counselor was remarkable. My father was furious that I did not attend. When I got home I explained to him that I was stranded on the side of the road for an hour and half, but he told me that wasn't an excuse and that I should have taken a cab. He ended up striking me several times with a set of jumper cables. But, five years later, my dad has forgiven me and my uncle remains sober.", "What is medically wrong with you?": "I've been told I have Alien Hand Syndrome but have never gotten an official diagnosis. It happens rarely and it didn't start occurring until middle school. One day I was playing shuffleboard in the laundry room with my older brother, and my dad walks in to get something out of the dryer while he's talking on a cordless phone. I was leaning against the wall right next to him, and I slowly grabbed the phone out of his hand and dropped it into the washing machine, which was filled with soapy water. I didn't even realize I'd done it, especially because my dad didn't say anything about it at first. He just walked out of the room and came back a few minutes later with a set of jumper cables and began beating me senseless.", "What's a problem that people would face in the post-apocalypse that most fictional works don't address?": "I'd assume no one would be driving after a few months. I once got the shit beat out of me with a set of jumper cables because I put a four month old container of gas into my dad's truck. The engine wouldn't start and he had to get it towed to a mechanic.", "When were you at your most anxious?": "Probably last year when I was making the switch from regular cigarettes to electronic cigarettes. It's difficult at first to figure out what nicotine level to start at. I started on a high dosage and it took me a while to determine if my stress was being caused by too little or too much nicotine. When I finally stepped down I noticed that a lot of my anxiousness went away. I'm definitely glad I made the switch to e-cigs though. Vaping has gotten me through some difficult times (my dad once beat the shit out of me with a set of jumper cables) and it really feels like they're healthier than regular cigarettes. Plus they're a lot cheaper than buying packs. I get all my liquid online, so the cost of smoking is now lower than my phone bill.", "If inanimate objects could orgasm, what would make the strangest sound?": "My dad's steam radiator makes a constant banging noise, so maybe that one specifically. I don't think steam radiators are typically loud though. A few months back my dad struck me severely with a set of jumper cables and I fell back and knocked my elbow against the radiator's air vent, and I think that's when the banging noise started.  The replacement part is $45 dollars though and I don't have the money atm.", "How old are you, and what new things have you been learning recently? (Big or small, anything)": "I'm 30 years old and I recently got married, and on my wedding day I learned that no matter how much time you spend with someone, there can be major aspects of their personality that you have never seen. At the dinner of my wedding, my dad told me a long story about how when he was fighting in Vietnam he and his platoon robbed a string of civilian families at gunpoint, and he used some of this money for drugs and some of it for a down payment on the house I grew up in. He later denied this story, passing it off as drunken ramblings, but I was sure it was the truth, so I continued to bring it up with him until one day he attacked me with a set of jumper cables. I haven't brought it up with him again since that day.", "whats the laziest thing you can?": "I can control the media center in my bedroom with a 7\" tablet. The tablet also controls AC and lighting in my bedroom, so I realized recently that I can sit on my couch and be entertained all day without moving more than one arm. I can also easily order food from the tablet with the Eat24 app. This is so easy to do, actually, that I once ordered food and completely forgot about it, and ended up leaving to eat with a friend before the food arrived. My dad had to pay $27 to the delivery guy when he showed up, and when I got home he beat the living shit out of me with a set of jumper cables.", "Reddit, what's a happy sounding song that is actually sad ?": "Beach Boys have some good examples of this, In My Room, God Only Knows. I always thought the song Don't Worry Baby was especially dark. It sounds to me like it's about some guy who suffers from some sort of anxiety disorder, and a girlfriend who's constantly trying to comfort him. My dad once beat the shit out of me with a set of jumper cables, and this song was playing in the background, so whenever I hear it I feel somewhat anxious.", "In the Oscar winning documentary Citizenfour, it is mentioned that there are 1.2 million people on some level of NSA watch list. How confident are you that you are, or are not, on such a list?": "I used to mess with my buddy by typing terrorist buzzwords into Google when using his computer, and then he'd later get me back by doing the same thing at my house. We thought that was really funny back in high school. My dad didn't think it was funny, he beat the shit out of me with a set of jumper cables. Anyway, nothing ever came of it. Honestly if I am on a watch list I wouldn't really care.", "What's the most embarrassing thing that you've ever intentionally done AND thought was cool/normal at the time?": "When I was 12 I thought it would be a good idea to set up a \"wacky\" voicemail greeting on our landline at home. It had background music, Give It Away by RHCP, which when combined with some terrible jokes made for a very cringe-worthy memory. Worst part was that my parents didn't know I'd done it, and when some business associate of my dad's pointed it out on a voicemail my dad beat the living shit out of me with a set of jumper cables.", "What was the dumbest thing you got \"in trouble\" for? (Detention, grounded, arrested...)": "In third grade I realized that you could bend quarters in half by putting them on their side and hitting them with a hammer repeatedly. I destroyed a dollar seventy five in change and when my dad found out he immediately went into prison gang war mode, and he beat the daylights out of me with a set of jumper cables. ", "What did you learn the really, really hard way?": "Don't do drugs because they're not worth it. My friends and I used to order this stuff called Poppy Tea in High School. The high was great but the withdrawals were god awful, and the worst part was that they completely prevented you from taking a dump, so when you were drinking this stuff every day you had a serious problem. One time my shipment got delayed and I had a three day gap without tea while on week two without taking a dump. I left this melon sized dump in my mom's toilet, which surprisingly flushed after a few attempts. Later my mom called my cell saying that I'd ruined her toilet, which I at first denied using, but then she called back and said that after plunging the toilet for about a half hour, she pulled up a piece of shit that was \"the size of a softball and the density of a cinder block.\" She said she put the shit in a plastic bag so my dad could see it later. When I got home my parents sat me down and insisted that we go straight to a hospital, so, figuring I was going to be caught eventually, I confessed that I had been using an opiate based tea and was not naturally constipated. My dad beat the shit out of me that night with a set of jumper cables. ", "What song is your guilty pleasure?": "I used to be really into Elliott Smith until one day my dad beat me with a set of jumper cables. Now I listen to Hip Hop, but every now and then I'll throw on Between the Bars or Son of Sam.", "Reddit, what is your all-time favorite video game and why?": "Honestly, probably Ms. Pacman. I play the newer ones too, but nothing tops this game. I built a [Multicade](http://www.jammaboards.com/) back when I was living with my dad just so I could play Ms. Pacman on fast mode. I often stayed up playing for 4-5 hours at a time, until my dad realized that I had seriously scratched up the hardwood floor by shaking the machine around. He beat the living shit out of me with a set of jumper cables and then he proceeded to disassemble the cabinet. Sucks, I had a pretty good score on that machine too, but I wasn't official anyway. Pretty sure Twin Galaxies doesn't accept scores on Multicades. ", "\"Older\" gamers of Reddit: Do you worry that one day you will be too old to play video games?": "I spent two years working in the IT department of a major video game company. I realized there that video games aren't a medium geared towards kids anymore. Most of the fans I'd see were adults and the studio operated just like a movie studio. The games no longer have ads, now they have trailers, and the trailers are clearly trying to appeal to an older audience. This might be common knowledge to your average video game player, but I remember back in the SNES days every video game ad you'd see had a bunch of kids playing the game. Back then video games were a symbol of the generation gap. Every kid I knew played them, and all the adults didn't. I clearly remember my dad beating me with a set of jumper cables because I spent all summer playing Final Fantasy 7 and had completely neglected my house chores. He'd constantly tell me that I was too old to be sitting around playing with \"toys.\" Now I go to Gamestop and see plenty of people who are as old as he was talking about how excited they are about the Witcher 3.", "Reddit, what triggers you?": "Whenever I fucked up big time as a kid my dad would march me into the garage and smack me with jumper cables, so now I avoid dead car batteries like the plague. Worst was the time I left the iron on and it fell onto the sofa. Man, he beat me good that day. In recent years I have gotten around this trigger by buying one of [these](http://www.amazon.com/gp/product/B00GT2FUB2/ref=oh_aui_detailpage_o07_s02?ie=UTF8&psc=1) and keeping it deep in my trunk, but even that freaks me out a little. I remember once in college I was sitting in my car listening to the radio and some guy walked up to the window with a set of jumper cables and asked if I could help him out with a jump. I didn't even roll the window down, just turned the car on and backed outta there.", "Have you ever had anything stolen from you? What was it?": "When I was in fourth grade a kid from my school showed up at my house with his dad crying and saying that I'd stolen his bike. I didn't steal his bike, my next door neighbor had given it to me, but my dad didn't believe me. So not only did I have to give this kid my bike, but my dad beat the shit out of me with a set of jumper cables. I later stole the bike back only to end up having to give it to the kid again, after of course getting another beat down...", "What's the most badass way you've ever scored a date and how did it go?": "I went to one of those underground raves back in high school and spent a good deal of time chopping it up with these two girls who were pretty cute. All of the sudden the lights turned on and this guy yelled that cops were at the door and everyone had to leave. One of the girls asked me to take her to another rave across town, I agreed. When we got into my car she said \"you know we're going to your house right?\", I agreed. I took her to my house and we snuck in through the garage and tip toed into my room. But within about five minutes of us being there my dad burst in yelling about me having his car out all night, and he proceeded to strike me repeatedly with a set of jumper cables while yelling at the girl to \"get the fuck out.\" She bolted out of the house and I never talked to her again. I don't know how she got home. I lived relatively far from her and the buses weren't running after midnight.", "Where would be the worst place to all of a sudden go blind?": "Driving on a freeway. I can tell you practically first hand, because when I was 8 I was horsing around in the back seat of my dad's car while we were in the fast lane and for some reason decided to cover his eyes with my hands. The car slid against the side wall before I took my hands off. My dad regained control of the car, took the next exit, pulled over, and proceeded to beat the living shit out of me with a set of jumper cables. ", "What is one major/minor thing you do that makes a day complete for you?": "I take [this daily men's multivitamin](http://www.amazon.com/gp/product/B00014JJ8Y/ref=oh_aui_detailpage_o05_s00?ie=UTF8&psc=1). It's been working really well, gives you more energy throughout the day. I try to take them every night at a consistent time, but some nights I'm not at home or something throws my schedule off. Last Thursday night my dad beat me up with a set of jumper cables, so I missed that day. I usually average about 6 days a week.", "Redditors who have been shot, what was that experience like?": "I was shot by accident in a domestic violence dispute with my dad when I was in high school. My dad found out that I had been using his gas card to fill my tank, as well as the tanks of a bunch of my friend's cars. I was at home watching Star Trek Voyager one day and suddenly my dad swings open my bedroom door holding the gas card bill in one hand and a set of jumper cables in the other. He didn't even ask me about the bill, he just started striking me hard with those jumper cables. I managed to get away from him and lock myself in his room, but that made him unbelievably furious and he started trying to kick the door down. So I grabbed the .22 from his closet and shouted that I'd shoot the door if he didn't stop. I was standing right in front of the door when he kicked it in, and the door knocked the gun out of my hand which flew directly back and fired when it hit the ground, shooting me in the ass. Luckily I was a fat kid and the bullet didn't get to a bone, but it was incredibly painful, not to mention that I was also having to fend off the jumper cables that my dad was striking me with. ", "If you could choose to see one concert of a dead singer/group from the past, who would it be?": "Probably Jimi Hendrix. My dad saw him a few times and said that it was hands down the best live performance he'd ever seen. He used to keep a photo in his glove box of himself and my mom standing next to Hendrix at the Monterey Pop Festival in 67, but when I was 9 I was playing around with it and accidentally let it fly out of the window on the highway. My dad drove back along that stretch of highway three times at dangerously low speeds looking for the photo, and when he finally concluded it was lost he parked the car and beat the living shit out of me with a set of jumper cables. ", "What's the scariest medical symptom you've ever had that turned out to be nothing?": "When I was 15 I found a shitload of my dead grandmother's Percocet, so I brought them to my friend Ray's house and we hung out in his room all afternoon crushing the pills up and snorting them while trying to play GTA 3 without nodding off. We were also repeatedly shotgunning Coors Lights on his patio. We eventually lost the energy to play videogames and just sat on his couch watching QVC. And then some ad came on for the Tylenol Helpline. It had all these warnings about not taking pills while drinking and it showed pictures of people who had jaundice, saying that your skin turns yellow when you're having life threatening liver problems. I started looking at my hand and was convinced that it was more yellow than normal, so I called my dad and confessed what I'd done. He picked me up and drove me to the emergency room, where I was basically told that I was fine and should not take drugs again. On the way home my dad pulled the car into a warehouse parking lot and told me I'd have to get out and walk home. He was furious. He got out and struck me repeatedly with a set of jumper cables and then he drove off.", "What invention do you think could be world-changing?": "A nap-wrap. Hear me out. OK, maybe it wouldn't be world-changing, but this needs to happen. As a restaurant server, part of my daily sidework has always been to take a knife, fork, and spoon and wrap them in a napkin with a sticker that says Chevy's or Chili's or Applebee's, etc. Many different restaurants do this, and they all use humans to do it. Well guess what? Human's aren't fast, and their hands aren't necessarily sanitary, even if they washed them recently. And they aren't cheap either. Usually this sidework takes a good half hour, but if we're busy it can take a lot longer. Last Tuesday I had to stick around an extra hour rolling these stupid things, and I couldn't pick my dad up from the optometrist on time so he took the bus, and when I finally made it home he beat the living shit out of me with a set of jumper cables. Wouldn't it be great to be able to just dump all the silverware into a machine that washes, sorts, and wraps them all automatically? ", "Why did you eat the entire full sized bag of Doritos in one sitting?": "Funny story related to this: One Christmas when I was 10, my parents took me and my sister to Illinois to visit my mom's extended family. It was a pretty boring trip for a 10 year old, my grandparents were old aristocrats who drank for hours at nice restaurants while talking to the adults and ignoring me and my sister, plus I had to obey a ton of rules of etiquette that no one else in the world follows. I eventually got excused to go to the bathroom and snuck out to the car, where I played GameBoy and ate a Doritos for about 40 minutes until I finished the bag. When I came back, no one seemed to notice how long I had been gone for, so I just went back to sitting there quietly. Then out of nowhere I felt like throwing up, and I darted towards the bathroom but only made it about halfway, where I projectile vomited orange sludge all over the hotel restaurant's white carpets. My dad immediately grabbed me by the arm and dragged me outside. Once he was sure I was done throwing up, he grabbed some jumper cables from the trunk of his car and beat me senseless.", "What is it that YOU just Don't get??": "I don't get sports. My dad has always been a HUGE sports fan, and when his team loses a big game it ruins his entire week. To me, I don't understand being so invested in something that has no real consequential outcome. Why would I care if a handful of people I've never met, who probably aren't from the city they're representing and probably would call for their bodyguard if I tried to say hello to them, can get some ball into a circle more times than another group of douchebags I've never met. What does that prove? That skill is not useful in any other situation. It could just as easily be a contest to see which group of seven people can stack cardboard boxes the fastest. I have talked to my dad about this twice before, but both times he cut me off mid sentence and went to the garage, where he grabbed a set of jumper cables and used them to beat me senseless. ", "What's the angriest you've ever seen somebody get? What happened?": "I used to play Magic the Gathering in middle school, and so did this crazy kid at my school. He often said that he liked to carve holes into pillows and have sex with them. One time he said he'd trade his Force of Nature and three Dual Lands for a pillow, so the next morning I tried smuggling a pillow to school in my backpack. I grabbed the smallest pillow we had and stuffed it in my bag, but it still made my backpack look like something out of Ghostbusters, and by the time we were outside walking to the car my dad knew something was up. When he opened the bag he just stood there puzzled for a moment, but then he went into this long explanation about how when he was a child he had Reye's syndrome and almost died, and that this pillow was sewn by my grandmother and it was given to him when he was in the hospital. He finally got around to asking me why I was bringing it to school and I told him I was going to trade it for Magic cards to a kid who carved holes into pillows and had sex with them. He then started pacing back and forth and looking around a lot and finally went to the car and grabbed a set of jumper cables which he struck me repeatedly with while a couple neighbors were watching. ", "Where were you during 9/11/01?": "I was baking a cake at home. I was 11 and my mother had let me put the cake in the oven and told me to set the timer for 30 minutes. Well, the oven had an unclear knob and I ended up accidentally changing the temperature to 550 degrees from 350. My dad was in hysterics because of what was happening on the tv set, and when that cake finally caught on fire he sent me straight to my room. At first I thought I had gotten off lightly, but after about an hour my dad walked in with the jumper cables and beat me senseless.", "Reddit, what completely ridiculous thing do you believe/believe in?": "One night when I was 11 sleeping in my aunt's guest room, aliens teleported in and used a ray gun to freeze me while they inserted a device in my brain. They've communicated with me ever since through vivid dreams, often requesting that I do things that end up landing me in a world of hurt with my dad. Worst was the time they requested I leave 10 pounds of chicken meat in the driveway. My dad beat the shit out of me that night with jumper cables.", "What is something that you would consider yourself to be literally obsessed with?": "Suede. I enjoy the texture, and most of my furniture is covered in suede. I can't fully relax without being able to rub my hands up and down some suede. It feels wonderful. When I was 13, I stole my father's suede jacket and kept it under my bed for about a month. He asked me if I'd seen it but I told him I hadn't. Then one night he walked into the bathroom to find me holding his jacket against my face. I thought he was asleep and had forgotten to lock the door. He must have thought I was masturbating or something because he quickly shut the door and apologized, but a moment later he opened it  again asking about the jacket. When he confirmed that it was his he ordered me to march straight into the garage, where he repeatedly struck me with jumper cables.", "What is the most embarrassing thing you have done when you were drunk?": "I was home visiting my parents during winter break at college. I walked home from a poker game so wasted that I passed out on the doorstep of the quiet Mormon family that lived down the street from my parents. The daughter was horrified to find me at 7am lying in fetal position at her front door covered in vomit, and she immediately slammed the door and screamed for her parents, at which point I got up and ran. Her parents talked to my parents, and my dad ended up taking me into the garage and striking me several times with jumper cables. I left to go back to college early, but I had blown most of my savings on beer, junk food, and poker. I tried to sell my Xbox 360 on craigslist for $80, but when I got to the Safeway parking lot the man who I had contacted attacked me with a fire iron and stole the box. I basically ended up starting a relationship with the chubby redhead in my economics class because I could not afford food for the month. I got her pregnant after three months, and ended up dropping out of college and picking up a job at Home Depot in the paint department where I still work to this day.", "Reddit, what is something you are embarrassed to admit?": "I once broke into Sears when they were closed and stole 40 dollars from the register. I was caught on camera and the police showed up at my house the next afternoon, but I wasn't there. I was out seeing Star Trek 6, the undiscovered country. I got home and my father brought me into the garage and struck me with jumper cables. I was grounded for the remainder of my summer vacation. My father, believing that my best friend Raymond was a bad influence, went to Raymond's house and had a long talk with his mother. I believe he cheated on my mom. He came back very late and struck me again with the jumper cables, this time for ruining the VCR. Later in the week my dog Charlie was euthanized because he had stomach cancer. I felt terrible about it for months, which caused me to be viewed as weird and introverted by my class during most of my freshman year. I failed math. When it's quiet and I stop thinking, I hear voices in my head that sound like radio commercials."}